app/Controllers/Cms.php

public function courtorground()
{
    $model = new \App\Models\CourtGroundModel();
    $courts = $model->findAll();
---
SELECT *
FROM `courtground`

public function edit_courtorground($id)
{
    $model = new \App\Models\CourtGroundModel();
    $court = $model->find($id);
---
SELECT *
FROM `courtground`
WHERE `courtground`.`id` = '1'

public function update_courtorground($id)
{
    $model = new \App\Models\CourtGroundModel();
    $court = $model->find($id);

    if (!$court) {
        return redirect()->back()->with('error', 'Court or Ground not found.');
    }

    $name = $this->request->getPost('name');
    $description = $this->request->getPost('description');
    $booking_url = $this->request->getPost('booking_url');

    // Check if new image uploaded
    $image = $this->request->getFile('image');
    if ($image && $image->isValid() && !$image->hasMoved()) {
        $newName = $image->getRandomName();
        $image->move('uploads/courts/', $newName);
        $imagePath = 'uploads/courts/' . $newName;
    } else {
        // Keep old image if no new one uploaded
        $imagePath = $court['image'];
    }

    $model->update($id, [
        'name' => $name,
        'description' => $description,
        'booking_url' => $booking_url,
        'image' => $imagePath
    ]);
---
SELECT *
FROM `courtground`
WHERE `courtground`.`id` = '1'
UPDATE `courtground` SET `name` = 'Badminton', `description` = '• Real-time availability\r\n• Book hourly slots\r\n• QR code payments', `booking_url` = 'http://localhost/NahataSports', `image` = 'uploads/courts/1751713591_29d76f111cd9f7721fc4.png'
WHERE `courtground`.`id` IN ('1')

            public function testimonials()
            {
                $model = new \App\Models\TestimonialModel();
                $testimonials = $model->findAll();
---
SELECT *
FROM `testimonials`

            public function save_testimonial()
            {
                $model = new \App\Models\TestimonialModel();

                $name = $this->request->getPost('name');
                $role = $this->request->getPost('role');
                $message = $this->request->getPost('message');

                // Optional: handle image upload
                $imageFile = $this->request->getFile('image');
                $imageName = '';

                if ($imageFile && $imageFile->isValid()) {
                    $imageName = $imageFile->getRandomName();
                    $imageFile->move('uploads/testimonials', $imageName);
                }

                if ($name && $role && $message) {
                    $model->save([
                        'name' => $name,
                        'role' => $role,
                        'message' => $message,
                        'image' => $imageName
                    ]);
---
INSERT INTO `testimonials` (`name`, `role`, `message`, `image`, `created_at`, `updated_at`) VALUES ('USer', 'Parent', 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. Richard McClintock, a Latin professor at Hampden-SyContrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. Richard McClintock, a Latin professor at Hampden-Sy', '1751714200_831ddc99a5bf909fa949.png', '2025-07-05 11:16:40', '2025-07-05 11:16:40')