app/Controllers/Home.php

      public function index()
{
    $heroModel = new \App\Models\HeroModel();
    $programModel = new \App\Models\CoachingProgramModel();
    $courtModel = new \App\Models\CourtGroundModel();
    $centerModel = new \App\Models\CenterModel();
    $featureModel = new \App\Models\StudentParentFeatureModel();
    $eventModel = new \App\Models\EventAnnouncementModel();
    $TestimonialModel = new \App\Models\TestimonialModel();
    $FaqModel = new \App\Models\FaqModel();


    $slides = $heroModel->findAll();
    $programs = $programModel->findAll();
    $courts = $courtModel->findAll();
    $multicenters = $centerModel->findAll();
    $studentparentfeatures = $featureModel->findAll();
    $events = $eventModel->findAll();
    $testimonials = $TestimonialModel->findAll();
    $FaqModel = $FaqModel->findAll();
---
SELECT *
FROM `coaching_programs`
SELECT *
FROM `courtground`
SELECT *
FROM `centers`
SELECT *
FROM `student_parent_features`
SELECT *
FROM `testimonials`
SELECT *
FROM `faqs`