app/Models/signup_model.php

    public function add($data)
    {
        $this->admin->insert($data);
---
INSERT INTO `admin` (`full_name`, `phone`, `username`, `email`, `password`) VALUES ('Prisha', '7774820475', 'Prisha', 'prisha@gmail.com', '$2y$10$EBmsL4tgfyzH7CIeFCODLeuPlEEwkL9goTxB8zZ/8A.OMYp0xuOW.')